{
  "academic_research_cooperation": "Academic Research Cooperation",
  "academic_research_desc": "The locale names are used for the translation files' locations, as well as your translated locales' base URL. When building all locales, only the default locale will have its name omitted in the base URL.",
  "submit_your_application_now": "Submit your application",
  "cooperation_case": "Cooperation Case",
  "cooperation_process": "Cooperation Process",
  "submit_application": "Submit Application",
  "affirm": "OSS Compass Affirm",
  "experiment_verify": "Experiment Verify",
  "conduct_joint_research": "Conduct Joint Research",
  "release_results": "Release Results",
  "submit_application_desc1": "If your university or research institution is interested in participating in OSS Compass Research in open source software measurement and ecological assessment is welcome to submit relevant cooperation interest through the website.",
  "submit_application_desc2": "We accept applications for research collaborations for open source ecological assessment, including but not limited to the following:",
  "submit_application_desc3": "Open source community productivity",
  "submit_application_desc4": "Open source software community governance and development stability",
  "submit_application_desc5": "Open source software innovation capability",
  "submit_application_desc6": "Open source software engineering Quality and safety",
  "submit_application_desc7": "Please provide information about you and your team, a summary of existing research findings or results, and the content areas in which you intend to collaborate with us.",
  "affirm_desc": "Our team will evaluate and confirm the cooperation applications received. Once the application is accepted, we will conduct further communication and detailed discussion with the partner institution via email or other appropriate means of communication.",
  "conduct_joint_research_desc": "After determining the details and objectives of the cooperation, the two sides will formally launch a joint study. OSS Compass will provide you with basic data sets for research in related fields, develop a research proposal together, and conduct a series of academic discussions and joint research.",
  "verify_desc": "When the joint research of both parties has been carried out to a certain extent and made progress, we will work with you to materialize the progress results into data indicators, measurement tools or analytical model capabilities for reference by the open source community, and provide experience services for the open source community through the OSS Compass community and platform to verify the research results. To ensure the reliability and feasibility of the research, and to further promote the development of the field of open source software measurement and ecological assessment.",
  "release_desc1": "Once the joint research has been completed and achieved, OSS Compass will work with you to organize, summarize and summarize the research results for wider sharing and dissemination. Results can take many forms, including but not limited to:",
  "release_desc2": "Provide measurement tools or analytical modeling capabilities with OSS Compass",
  "release_desc3": "Jointly publish research reports, paper publications, technical guidelines, etc.",
  "discuss_the_evolution": "Discuss the evolution of open source research with 10 universities and research institutions",
  "nju_title": "Predicting open source project activity based on OSS Compass metrics",
  "nju_desc": "Innovation Training Program for College Students in 2024, 'Research on Health Prediction Technology of Open Source Software Projects Based on Metrics', Nanjing University. Members: Zheng Liu, Xiaolan Zu, Xingyu Luo, Zihang Wang, Department of Computer Science and Technology, Nanjing University",
  "pku1_title": "Intelligent Recommendation for Beginner Tasks: GFI-Bot",
  "pku1_desc1": "Scenario: Automatically labeling open issues for open-source projects, determining whether they are 'beginner' tasks",
  "pku1_desc2": "Measuring the features of beginner tasks for precise recommendations",
  "pku2_title": "Intelligent Recommendation for Library Migration: MigrationAdvisor",
  "pku2_desc1": "Scenario: The software needs to migrate its third-party libraries to another third-party library with the same or similar functionality.",
  "pku2_desc2": "Method: By utilizing data to construct effective measures, we can provide a list of alternative libraries for migration with high accuracy and recall rates.",
  "pku3_title": "Open Source Software License Recommendation Tool: LicenseRec",
  "pku3_desc1": "Problem: Faced with a large number of similar licenses and complex legal terms, how can we help developers choose an open-source license suitable for their own projects?",
  "pku3_desc2": "Innovation: On the basis of complying with the licenses of third-party components in the project, we recommend licenses that satisfy user preferences from three aspects: open-source style, business needs, and community development.",
  "openeuler_title": "OpenEuler Docs Bug Catching",
  "openeuler_desc": "OpenEuler docs bug catching sponsored by the openEuler community, the event aims to understand the real scenarios of document developers, and constantly improve and perfect the documentation, so as to help developers better use the openEuler operating system and related software. The openEuler community welcomes all suggestions, big and small, to improve the documentation.",
  "experience_immediately": "Experience Now"
}
