{
  "academic_research_cooperation": "Compass Collaboration",
  "academic_research_desc": "Through Compass collaboration, we establish a bridge between academia, industry, and research, promote academic achievements and best practices in open source, and enhance collaboration efficiency.",
  "submit_your_application_now": "Contact Us",
  "cooperation_case": "Cooperation Case",
  "cooperation_process": "Cooperation Process",
  "submit_application": "Submit Application",
  "affirm": "OSS Compass Confirm",
  "conduct_joint_research": "Conduct Joint Research",
  "experiment_verify": "Experiment Verification",
  "release_results": "Release Results",
  "submit_application_desc1": "If your research institution or community is interested in academic research or program promotion with OSS Compass, please submit your cooperation intention through the website.",
  "submit_application_desc2": "The areas of cooperation include but are not limited to:",
  "submit_application_desc3": "Open source community and software evaluation programs",
  "submit_application_desc4": "Open source community governance and operation programs",
  "submit_application_desc7": "To submit your cooperation intention, please provide information about yourself and your team, a brief description of existing research or achievements, and the areas in which you intend to conduct research collaboration with us.",
  "affirm_desc": "Our team will evaluate and confirm the received cooperation applications. Once the application is accepted, we will communicate and discuss further details with the collaborating organization through email or other suitable communication methods.",
  "conduct_joint_research_desc": "After determining the cooperation details and objectives, both parties will officially conduct joint research. OSS Compass will provide you with foundational datasets in the relevant research field, jointly develop research plans, and engage in a series of academic seminars and collaborative research.",
  "verify_desc": "When the joint research between both parties has made progress, we will work together to transform the research progress into data metrics, measurement tools, or analysis models for the open source community. Through the OSS Compass community and platform, we will provide experiential services to validate research results, ensuring the reliability and feasibility of the research, and further promote the development of open source software metrics and ecosystem evaluation.",
  "release_desc1": "Once the joint research is completed and achieves the expected goals, OSS Compass will collaborate with you to organize, summarize, and present the research findings for wider sharing and dissemination. The release can take various forms, including but not limited to:",
  "release_desc2": "Providing measurement tools or analysis models through OSS Compass",
  "release_desc3": "Jointly publishing research reports, papers, technical guides, etc.",
  "discuss_the_evolution": "OSS Compass community collaborates with academia and industry to discuss and advance open source collaboration.",
  "author": "Author:",
  "nju_title": "Predicting Open Source Project Activity Based on OSS Compass Metrics",
  "nju_author": "Authors: Zheng Liu, Xiaolan Zu, Xingyu Luo, Zihan Wang ,Nanjing University undergraduate;Jierui Zhang, PhD candidate at Nanjing University. Department of Computer Science and Technology, Nanjing University - National Key Laboratory of Software New Technology, OSS Compass Community",
  "nju_author2": "Advisor: Liang Wang, Xianping Tao, Yehui Wang.",
  "nju_desc": "Introduction: Research on the Prediction of Open Source Software Project Health Based on Metrics in the Innovation Training Program for College Students at Nanjing University in 2024. Reference article:",
  "nju_desc2": "This method predicts the future activity status of open source projects based on OSS Compass metrics. The method uses a feature-based time series classification prediction method by extracting statistical features from the OSS Compass metric sequence. It trains and applies machine learning intelligent classification models to predict the future active/inactive status of projects and provides approximate probability estimates. Cross-validation results on nearly 600 project datasets show an accuracy rate close to 90% for this method. In terms of generalization ability, this method can still achieve an accuracy rate of 80% on a dataset of over ten thousand repositories, demonstrating its preliminary practicality. The analysis results can partially reflect the future health status of open source projects and demonstrate the effectiveness of the OSS Compass metric system in measuring the health of open source software. This method is expected to provide valuable reference information for users, developers, investors, and managers of open source software.",
  "pku1_title": "Intelligent Recommendation for Beginner Tasks: GFI-Bot",
  "pku1_author": "Author: Wenxin Xiao, Ph.D. candidate at Peking University, researching sustainability of open source software projects.",
  "pku1_author2": "Advisor: Professor Minghui Zhou",
  "pku1_desc1": "Introduction: On the GitHub platform, many projects use the 'good first issue' (GFI) labeling mechanism to mark problems suitable for beginners, guiding them to make their first contributions to the project by addressing these introductory tasks. Tan et al.'s research found that the popularity of this mechanism is gradually increasing. However, in most projects, the proportion of issues marked as GFI is relatively low. What is even more concerning is that the resolution rate of GFI issues is not optimistic. Among all GFI issues, only about 60% are successfully solved by beginners, and a large number of GFI issues remain unresolved. On platforms like GitHub, each issue contains not only a title and description but also diverse features such as labels and comments. Therefore, Xiao et al. proposed an automatic labeling method for beginner tasks based on multiple task features. Using an XGBoost classifier, they classify issues solved by beginners from other issues at two time points: when the issue is opened and when it is resolved.",
  "pku1_desc2": "Project URL:",
  "pku2_title": "Intelligent Recommendation for Library Migration: MigrationAdvisor",
  "pku2_author": "Authors: Haiqiao Gu, Hao He and Yiliang Zhao, PhD candidates at Peking University.",
  "pku2_author2": "Advisor: Professor Minghui Zhou, Academician Huaimin Wang, etc.",
  "pku2_desc1": "Introduction: Although the adoption of third-party libraries in software projects is beneficial, it also carries risks. Adopted third-party libraries may be abandoned by their maintainers, may have license compatibility issues, or may no longer meet the current project's needs. In such cases, developers need to migrate libraries to other libraries with similar functionality. However, due to limited information available, migration decisions are often subjective and not optimal. He et al. proposed a new method that ranks library migrations by utilizing multiple indicators to recommend the most suitable migration plan. Given a library that needs to be migrated, a large number of candidate target libraries are generated from various software repositories. These libraries are then ranked based on four indicators that capture evidence from different dimensions of development history: rule support, message support, distance support, and API support. Through intelligent analysis of a large number of GitHub repositories and Java libraries, it can recommend target libraries for library migration. The correctness of the results has been systematically evaluated, and the tool's practicality has been assessed through feedback from industry developers.",
  "pku2_desc2": "Project URL:",
  "pku3_title": "LicenseRec: An Open Source Software License Recommendation Tool",
  "pku3_author": "Author: Weiwei Xu, Ph.D. candidate at Peking University, specializing in open source software licenses.",
  "pku3_author2": "Advisor: Professor Minghui Zhou",
  "pku3_desc1": "Introduction: When developers face a large number of similar licenses and complex legal terms, the problem of how to choose the right open source license for their projects arises. Xu et al. proposed LicenseRec, an open source software license recommendation tool, aiming to help users select licenses that meet their preferences based on compliance with third-party component licenses, open source style, business requirements, and community development. To achieve this goal, a knowledge base was built, which includes common license terms, compatibility information, and license selection guidelines. The workflow involves scanning the licenses of third-party components, checking license compatibility, and characterizing user preferences through user interaction. Then, based on this information, the tool recommends the most suitable license. This tool can scan and check the licenses of third-party components for compatibility and also characterize user preferences to recommend licenses that best meet their needs.",
  "pku3_desc2": "Tool link:",
  "pku3_desc3": "Project URL:",
  "openeuler_title": "openEuler Document Simulated Reading Companion",
  "openeuler_author": "Author: openEuler Community",
  "openeuler_desc1": "Introduction: The document simulated reading companion solution is designed and promoted by the openEuler community. It helps the community continuously improve and enhance the quality and user experience of the documentation without interrupting the reading experience of users.",
  "openeuler_desc2": "Project URL:",
  "experience_immediately": "Experience Immediately",
  "experience": "Experience",
  "calculate": "Calculate",
  "type_address_of": "Please enter the repository URL",
  "please_enter_a_valid": "Please enter a valid URL",
  "failed_to_fetch_data": "Failed to fetch data!",
  "result": "Calculation Result:"
}
