{
  "api_documentation": "API Documentation",
  "try_it_out": "Try it out",
  "parameters": "Parameters",
  "send_request": "Send Request",
  "archived_data": "Archived Data",
  "opensource_insight": "Open Source Ecosystem Insight",
  "about": "About",
  "data_download_title": "Data Download",
  "data_download_description": "The OSS-Compass community is committed to providing comprehensive services for open-source data and model research, offering rich resources for developers, researchers, and enterprises.",
  "download_methods": "We provide two download methods to facilitate users in obtaining the required open-source data and models:",
  "rest_api": "REST API",
  "rest_api_description": "For users requiring large-scale data access, we provide an API interface download method. Users can programmatically call our API to flexibly obtain data.",
  "archive_download": "Archive Data Download",
  "archive_download_description": "Users can directly download the required archived open-source data and models through the download links provided by our platform.",
  "introduction": "Introduction",
  "api_introduction_title": "API Introduction",
  "api_introduction_description": "OSS-Compass provides a powerful REST API that helps developers, researchers, and enterprises quickly access open-source data and model resources. Through our API, you can flexibly obtain the required data, supporting large-scale data access and automation.",
  "usage_instructions_title": "Usage Instructions",
  "usage_instructions_description": "Using our API is very simple; just follow these steps:",
  "step_one": "Register and log in to the OSS-Compass platform.",
  "step_two": "Generate your API private token in account settings.",
  "step_three": "Use the interface instructions in the API documentation to build your request.",
  "token_authentication_title": "Token Authentication",
  "token_authentication_description": "All API requests require authentication via a token. Here are the steps to use the token:",
  "token_step": "Add the following to the request parameters",
  "token_example": "field.",
  "token_example_code": "Example:",
  "example_code_title": "Example Code",
  "example_code_description": "Here is an example code of calling the API using JavaScript:",
  "data_source": "Data Source",
  "insight_description": "Provides open-source data and model resources for open-source insight.",
  "insight_dataset": "Open Source Insight Dataset",
  "insight_dataset_description": "The Open Source Insight Dataset includes basic information, activity levels, and community sizes of open-source projects.",
  "name": "Name",
  "description": "Description",
  "download_link": "Download Link",
  "download": "Download",
  "date_select": "Date",
  "quarter": "Quarter",
  "year": "Year",
  "contribution_dataset": "Contribution Dataset",
  "contribution_dataset_description": "Includes open-source contribution data of all countries in the world and all cities in China.",
  "contributor_dataset": "Contributor Dataset",
  "contributor_dataset_description": "Includes data on active and new open-source contributors in all countries around the world and all cities in China.",
  "import_export_dataset": "Import & Export Dataset",
  "import_export_dataset_description": "Includes the flow and scale data of developer contribution import and export among countries worldwide. The code contributed by developers from a country or region to open-source projects in other countries or regions is \"export\", and the code contributed by developers from other countries or regions to open-source projects in this country or region is \"import\".",
  "language_dataset": "Language Dataset",
  "language_dataset_description": "Includes the distribution of main programming languages used in open-source projects globally and across regions in China.",
  "license_dataset": "License Dataset",
  "license_dataset_description": "Includes the types and distribution of mainstream open-source licenses adopted by projects worldwide and in China.",
  "repo_dataset": "Repository Dataset",
  "repo_dataset_description": "Includes the development trends in the number of open-source repositories globally and in various regions of China.",
  "technology_dataset": "Technology Domain Dataset",
  "technology_dataset_description": "Includes the main technology domains involved in open-source projects worldwide and in China, as well as their popularity trends."
}
