{
  "academic_research_cooperation": "Compass 协作",
  "academic_research_desc": "通过 Compass 协作，我们建立产学研合作桥梁，推广学术成果与开源最佳实践，提升开源协作效率",
  "submit_your_application_now": "联系我们",
  "cooperation_case": "合作案例",
  "cooperation_process": "合作流程",
  "submit_application": "提交合作申请",
  "affirm": "OSS Compass 确认",
  "conduct_joint_research": "展开联合研究",
  "experiment_verify": "实验验证",
  "release_results": "成果发布",
  "submit_application_desc1": "如果您所在的科研机构和社区有意与 OSS Compass 开展学术研究或方案推广，欢迎通过网站提交相关合作意向。",
  "submit_application_desc2": "合作领域包括但不限于以下几个方面：",
  "submit_application_desc3": "开源社区与软件评估方案",
  "submit_application_desc4": "开源社区治理与运营方案",
  "submit_application_desc7": "提交合作意向请提供您和您的团队信息，已有研究沉淀或成果简述，以及您意向与我们展开研究合作的内容领域。",
  "affirm_desc": "我们的团队会对收到的合作申请进行评估和确认。一旦申请被接受，我们将与合作机构通过电子邮件或其他适合的沟通方式进行进一步的沟通和详细讨论。",
  "conduct_joint_research_desc": "在确定合作细节和目标之后，双方将正式展开联合研究。OSS Compass 将为您提供相关领域研究的基础数据集，共同制定研究计划，并展开一系列的学术研讨和共同研究。",
  "verify_desc": "当双方的联合研究进行到一定程度并取得进展，我们将会与您共同尝试，将进展成果尝试物化为开源社区参考的数据指标、度量工具或分析模型能力，通过 OSS Compass 社区和平台，面向开源社区提供体验服务，用于验证研究成果，以确保研究的可靠性和可行性，并进一步推动开源软件度量和生态评估领域的发展。",
  "release_desc1": "一旦联合研究完成并达到预期目标，OSS Compass 将与您共同对研究成果进行整理、归纳和总结，以便于更广泛的分享和传播。成果发布可以采用多种形式，包括但不仅限于：",
  "release_desc2": "通过 OSS Compass 提供度量工具或分析模型能力",
  "release_desc3": "联合发布研究报告、论文发表、技术指南等。",
  "discuss_the_evolution": "OSS Compass 社区与产学研各界共同探讨和推进开源协作",
  "author": "作者：",
  "oss_selection_title": "开源选型评估服务",
  "oss_selection_author": "作者：徐浩然、乔昕雨、戎昱等同学，南京大学，OSS Compass 社区",
  "oss_selection_author2": "导师：汪亮",
  "oss_selection_desc": "简介：在数字化基础设施高度依赖开源的今天，软件系统中的绝大部分模块已经由开源组件构成。无论是构建 CI/CD 流水线、微服务架构、可视化工具，还是企业级数据库中间件，几乎每一个技术决策都要面临开源软件的选型问题。OSS-Compass 社区推出了'开源选型评估服务'，其中的智能选型功能是由OSS-Compass社区与南京大学计算机学院副教授汪亮及其团队共同设计完成。它构建一个数据驱动、可量化、具可比性的选型支撑体系，让'选型'从主观经验驱动转变为指标与数据驱动的智能决策过程。",
  "nju_title": "基于 OSS Compass 指标预测开源项目活跃度",
  "nju_author": "作者：刘政、祖小岚、罗星宇、王子杭，南京大学本科生；张洁芮，南京大学博士研究生。南京大学计算机科学与技术系--软件新技术全国重点实验室、OSS Compass 社区。",
  "nju_author2": "导师：汪亮、陶先平、王晔晖",
  "nju_desc": "简介：南京大学 2024 年大学生创新训练计划《基于度量指标的开源软件项目健康度预测技术研究》。参考文章：",
  "nju_desc2": "本方法基于 OSS Compass 指标预测开源项目的未来活跃状态。该方法采用了基于特征的时间序列分类预测方法，通过提取 OSS Compass 指标序列中的统计特征，训练并运用机器学习智能分类模型对项目未来的活跃/不活跃状态进行预测，同时给出近似概率估计。在近 600 个项目数据集上的交叉验证结果显示，该方法的准确率接近 90%。在泛化能力方面，本方法在超过一万个仓库的数据集上仍能够达到 80% 的准确率，初步具备现实可用性。分析结果能够部分反映开源项目的未来健康状态，进而展示了 OSS Compass 指标体系在度量开源软件健康度上的有效性。该方法有望为开源软件的用户、开发者、投资者和管理者提供有价值的参考信息。",
  "nju2_title": "基于信息熵的开源社区演化行为度量方法",
  "nju2_author": "作者：张洁芮，李颖。南京大学计算机科学与技术系--软件新技术全国重点实验室、OSS Compass 社区。",
  "nju2_author2": "导师：汪亮、陶先平",
  "nju2_desc": "简介：本研究针对开源开发者社交网络中的演化行为认知这一主题，为克服传统社区演化行为分析技术偏重定性而非定量这一局限性，提出了一组基于信息熵的社区分裂、缩减、合并和扩大指数来度量开源开发者社交网络中的社区演化行为。实证研究表明，该组指数能够有效刻画开源社区的演化，通过简单的规则变化能够取得和现有定性工作相一致的结论，准确率达到 94.1%。同时，进一步的研究表明，所提出的社区演化指数与开源项目以 commit 数量为代表的生产力之间存在显著的关联关系。本研究所提出的基于信息熵的度量指数为我们定量认知和分析开源社区的演化行为提供了支持。参考文章：",
  "nju3_title": "基于熵的开源软件 Fork 副本多样性度量方法",
  "nju3_author": "作者：郑智文、吴向臣、桑百惠、张洁芮。南京大学计算机科学与技术系--软件新技术全国重点实验室、OSS Compass 社区。",
  "nju3_author2": "导师：汪亮、陶先平",
  "nju3_desc": "简介：本研究聚焦于开源软件（OSS）平台上的项目副本，围绕衡量和理解开源软件项目中副本多样性展开。本文通过构造基于 Rao 二次熵的新型副本熵，并基于项目文件的修改来衡量这种多样性。实证研究表明，开源项目的副本熵与不同的主效应之间存在显著相关性，其中包括项目的外部生产力（由外部贡献者的提交数量度量）、外部贡献者 pull-request 的接受率以及已报告的 bug 数量。此外，我们还观察到副本熵与其他因素（如副本数量）之间存在显著的交互作用。这些结果表明，副本熵作为一个有效指标，不仅丰富了当前关于开源软件项目副本的可用度量，还进一步加深了基于副本仓库开源软件发展过程的认识，并且有望支持进一步的研究和应用。参考文章：",
  "nju4_title": "开源软件度量评估平台",
  "nju4_author": "作者：胡晓通、柴晓琪、段庸、刘焚勤  南京大学",
  "nju4_author2": "导师：司徒凌云 南京大学",
  "nju4_desc": "简介：软件研发过程中，不可避免需要引入第三方开源软件。然而，开源软件数量众多，版本迭代速度快，文档质量低，开发者难以判断开源软件是否满足功能需求、摆脱安全缺陷、适配业务场景。有效的开源软件度量评估是实现开源软件质量优选的关键。为此，我们构建了开源软件度量评估平台，实现了度量过程的标准化、度量模型的自定义、度量工具的可扩展，以及度量结果的可解释。平台内嵌了自研的软件功能度量工具，可以为开源软件自动生成函数API、类、模块以及仓库等多层级的功能性理解文档，支持同类型多软件的对比分析，支撑软件研发场景下的开源软件功能选型与质量优选。",
  "pku1_title": "新手任务的智能推荐：GFI-Bot",
  "pku1_author": "作者：肖文鑫，北京大学博士研究生",
  "pku1_author2": "导师：周明辉教授",
  "pku1_desc1": "简介：在 GitHub 平台上，众多项目运用了“标签”机制，将适合新手解决的问题标记为'good first issue'（以下简称为 GFI），以此引导新手通过处理这些初级任务，完成对项目的首次贡献。Tan 等人的研究发现，这种机制的受欢迎程度正在逐步上升。然而，在大部分项目中，被标记为 GFI 的问题所占比例相对较低。更加令人疑虑的是，GFI 问题的解决状况并不乐观。在所有的 GFI 问题中，仅有大约 60% 的问题被新手成功解决，而大量的 GFI 问题仍然未被解决。在 GitHub 这样的平台上，每个 Issue 不仅包含标题和描述，还融合了标签、评论等多元化的特征。因此，Xiao 等人提出了一种基于任务多元特征的新手任务自动标记方法，分别在 Issue 的开放时刻和解决时刻两个时间点，通过 XGBoost 分类器，对新手解决的问题和其他问题进行分类。",
  "pku1_desc2": "项目地址：",
  "pku2_title": "库迁移的智能推荐：MigrationAdvisor",
  "pku2_author": "作者：谷海桥、何昊、赵益良，北京大学博士研究生",
  "pku2_author2": "导师：周明辉教授、王怀民院士",
  "pku2_desc1": "简介：随着开源软件（OSS）的兴起和软件包托管平台的发展，越来越多的开发者选择重用现有的第三方库进行项目开发，从而降低开发成本，提高开发效率。然而，在重用第三方库的过程中，当开发者无法通过升降级来解决库中存在的问题，如安全漏洞、兼容性等，就需要用另一个功能相同或相似的第三方库来代替，这种操作被称为库迁移。但由于现有信息有限，开发者在进行替换库的选择时，往往基于主观意见并非最佳选择。通过对历史开发活动进行分析，并利用多个指标对库迁移进行排序，可以推荐最适合的库迁移方案。首先从大量的软件仓库中挖掘迁移历史，构建迁移知识库；给定一个需要迁移的库后，筛选出候选的目标库，然后通过结合相关指标来对它们进行排序，这些指标从开发历史的不同维度捕获证据：规则支持、原因支持、距离支持和 API 支持；通过对大量 GitHub 仓库的智能分析，能够推荐出库迁移的目标。",
  "pku2_desc2": "项目地址：",
  "pku3_title": "开源软件许可证推荐工具：LicenseRec",
  "pku3_author": "作者：徐卫伟，北京大学博士研究生",
  "pku3_author2": "导师：周明辉教授",
  "pku3_desc1": "简介：面对开发者在面对大量相似的许可证和复杂的法律条款时，如何选择适合自身项目的开源许可证的问题，Xu 等人提出了开源软件许可证推荐工具 LicenseRec，旨在帮助创新之处在于，在遵从项目中第三方组件许可证的基础上，从开源风格、商业需求以及社区发展三个方面推荐满足用户偏好的许可证。为了实现这一目标，构建了一个包含常见许可证条款特征、兼容性信息和许可证选择指南的知识库。工作流程包括：扫描第三方组件的许可证、检查许可证的兼容性、通过用户交互来刻画用户的偏好。然后，根据这些信息，推荐出最适合的许可证。该工具可以进行第三方组件许可证的扫描和兼容性检查，同时也能刻画用户的偏好，从而推荐出最符合用户需求的许可证。",
  "pku3_desc2": "工具链接：",
  "pku3_desc3": "项目地址：",
  "openeuler_title": "openEuler 文档模拟伴读",
  "openeuler_author": "作者：openEuler 社区",
  "openeuler_desc1": "简介：文档模拟伴读方案由 openEuler 社区设计并推广，用户在不中断阅读体验的前提下，帮助社区不断改进和完善文档，提升文档质量和用户体验。",
  "openeuler_desc2": "项目地址：",
  "experience_immediately": "立即体验",
  "contact_immediately": "联系试用",
  "experience": "效果体验",
  "isc_title": "中国科学院软件研究所开源中心仓",
  "isc_author": "作者：中国科学院软件研究所",
  "ics_desc": "开源中心仓面向企业开源软件供应链安全，解决开源软件可信接入、管理和分发等问题。基于源图和开源指南针提供的基础能力，面向金融、能源、电信运营商等企业提供可信制品清单、深度安全分析、开源维护性风险评估及合规风险看护服务，保障企业开源软件供应链安全。",
  "calculate": "计算",
  "type_address_of": "请输入仓库地址",
  "please_enter_a_valid": "请输入合法 url",
  "failed_to_fetch_data": "获取数据失败 !",
  "result": "计算结果：",
  "data_usage_process": "数据使用申请",
  "atom_title": "开放原子开源基金会全球开源协作大屏",
  "atom_desc": "开放原子开源基金会全球开源协作大屏展示了全球各国开源发展情况，涵盖活跃开源项目数量、活跃开发者数量、代码提交量等关键指标。数据来源于OSS Compass，提供实时、准确的开源生态系统分析，帮助用户了解不同国家在开源领域的表现与贡献。",
  "oh_title": "OpenHarmony TPC 治理平台",
  "oh_desc": "OpenHarmony TPC治理平台提供完整的软件三方库治理流程，包括选型、孵化和毕业。通过系统化的评估机制，确保所选库的质量与适用性。孵化阶段提供技术支持，帮助项目发展；毕业后，平台持续监控与维护，确保项目在社区中的健康成长。",
  "deep_insight_title": "OSS Compass 项目深度洞察",
  "deep_insight_desc": "OSS Compass 项目深度洞察提供开源社区的贡献者画像、Issues 和 PRs 详情，致力于为开源社区提供可靠的数据和技术服务支持。通过深入分析，提升社区效能，推动健康发展，帮助开发者更好地参与和贡献于开源生态系统。"
}